ЛИС2/src/Catalogs/лис_Лаборатории/лис_Лаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>лис_Лаборатории</name>
  <owners>Catalog.Организации</owners>
  <tabularSections>
    <name>ПереченьМетодикИзмерения</name>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МетодикаИзмерения</name>
      <type>
        <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/лис_ОтметкаМестонахожденияЛабораторногоОборудования/лис_ОтметкаМестонахожденияЛабораторногоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_ОтметкаМестонахожденияЛабораторногоОборудования</name>
  <registerRecords>InformationRegister.лис_МестонахождениеЛабораторногоОборудования</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовоеМестонахождение</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
</mdclass:Document>

ЛИС2/src/Catalogs/лис_Лаборатории/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОборудованиеВЭксплуатации.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Владелец);
		ОборудованиеВЭксплуатации.Параметры.УстановитьЗначениеПараметра("Лаборатория", Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСведенияОбОборудовании(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
		ПараметрыФормы = СформироватьСтруктуруСведений(ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.СведенияОбОборудовании", ПараметрыФормы
					,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;				
				
КонецПроцедуры


&НаСервере
Функция СформироватьСтруктуруСведений(ТекущаяСтрока)
	
	ПараметрыФормы = Новый Структура("Организация, Лаборатория, Оборудование, РегистрационныйНомер, ИнвентарныйНомер, ЗаводскойНомер, 
								| ЗаводскоеОбозначение, НомерПаспортаНаОборудование, ДатаИзготовления, 
								| ДатаВводаВЭксплуатацию, СрокДопустимойЭксплуатации");
	ПараметрыФормы.Организация = Объект.Владелец;
	ПараметрыФормы.Лаборатория = Объект.Ссылка;
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущаяСтрока);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументОПоверке(Команда)
	
	ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
	ПараметрыФормы = СформироватьПараметрыФормы(ТекущаяСтрока);
	ОткрытьФорму("Документ.лис_ПоверкаЛабораторногоОборудования.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументОРемонте(Команда)
	
	ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
	ПараметрыФормы = СформироватьПараметрыФормы(ТекущаяСтрока);
	ОткрытьФорму("Документ.лис_ОтправкаВРемонтЛабораторногоОборудования.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьДокументПеремещения(Команда)
	
	ТекущаяСтрока = Элементы.ОборудованиеЛаборатории.ТекущиеДанные;
	ПараметрыФормы = СформироватьПараметрыФормы(ТекущаяСтрока);
	ОткрытьФорму("Документ.лис_ОтметкаМестонахожденияЛабораторногоОборудования.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция СформироватьПараметрыФормы(ТекущаяСтрока)
	
	ПараметрыФормы = Новый Структура("Регистратор, Организация, Лаборатория, Оборудование, РегистрационныйНомер, ИнвентарныйНомер, ЗаводскойНомер");
	ПараметрыФормы.Организация = Объект.Владелец;
	ПараметрыФормы.Лаборатория = Объект.Ссылка;
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущаяСтрока);
	
	Возврат ПараметрыФормы;
	
КонецФункции
